Following Python code shows how to connect to an existing database. If the database does not exist, then it will be created and finally a database object will be returned.

In [ ]:
#Connect To Database
import sqlite3

conn = sqlite3.connect('testdb.db')

print("Opened database successfully")

In [ ]:
##Create a Table
#!/usr/bin/python

import sqlite3

conn = sqlite3.connect('testdb.db')
print("Opened database successfully")

conn.execute('''CREATE TABLE COMPANY
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         SALARY         REAL);''')
print("Table created successfully")

conn.close()

In [ ]:
#INSERT Operation
#!/usr/bin/python

import sqlite3

conn = sqlite3.connect('testdb.db')
print("Opened database successfully")

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (1, 'Paul', 32, 'California', 20000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (2, 'Allen', 25, 'Texas', 15000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (3, 'Teddy', 23, 'Norway', 20000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (4, 'Mark', 25, 'Rich-Mond ', 65000.00 )");

conn.commit()
print("Records created successfully")
conn.close()

In [2]:
conn = sqlite3.connect('testdb.db')
cur = conn.cursor()
def get_posts():
    with conn:
        cur.execute("SELECT * FROM COMPANY")
        print(cur.fetchall())

In [3]:
get_posts()

[(1, 'Paul', 32, 'California', 20000.0), (2, 'Allen', 25, 'Texas', 15000.0), (3, 'Teddy', 23, 'Norway', 20000.0), (4, 'Mark', 25, 'Rich-Mond ', 65000.0)]

In [ ]:
#SELECT Operation
#display records from the table
#!/usr/bin/python

import sqlite3

conn = sqlite3.connect('testdb.db')

cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
   print("ID = ", row[0])
   print("NAME = ", row[1])
   print("ADDRESS = ", row[2])
   print("SALARY = ", row[3], "\n")

conn.close()

In [1]:
#UPDATE Operation
import sqlite3

conn = sqlite3.connect('test.db')
conn.execute("UPDATE COMPANY set SALARY = 24800.00 where ID = 1")
conn.commit
print("Total number of rows updated :", conn.total_changes)
cursor = conn.execute("SELECT id,name,address,salary from COMPANY")
for row in cursor:
    print("id,", row[0])
    print("NAME = ", row[1])
    print("ADDRESS = ", row[2])
    print("SALARY = ", row[3], "\n")
conn.close()

Total number of rows updated : 1
id, 1
NAME =  Paul
ADDRESS =  California
SALARY =  24800.0

id, 2
NAME =  Allen
ADDRESS =  Texas
SALARY =  15000.0

id, 3
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

id, 4
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0

In [ ]:
#DELETE operation
import sqlite3
conn = sqlite3.connect('test.db')
conn.execute("DELETE from COMPANY where ID = 2")
conn.commit
print("changes", conn.total_changes)
cursor = conn.execute("SELECT id,name,address,salary from COMPANY")
for row in cursor:
    print("id,", row[0])
    print("NAME = ", row[1])
    print("ADDRESS = ", row[2])
    print("SALARY = ", row[3], "\n")
conn.close()